// типы данных
// String - тип данных для текста
// Number - тип данных для числ
// Boolean - тип данных для логических значении(true/false)
// null - специальное значение,которое означает "отсуствиет значении"
// underfined - тип который означает что переменая не былат инициализирована
// Object - тип данных для обьектов которое могут содержвть свойства т методы
// BigInt - тип данных для больших целых чисел 
// Symbol - тип данных для уникальных идентификаторов

// let hfhfh = "hello world";
// console.log(typeof hfhfh);

// let a = 42; 
// console.log(typeof a);

// let b =  "123456789"
// console.log(typeof b);

// условия оператора
// if (условия){
//   код который выполняяется.если условие истино 
// } else {
// код который выполнится.если условие ложно 
 // }

//  if (5 < 3) {
//    console/log("5 больше 3");
//  }else{
//     console.log("5 меньше 3");
//  }

//  let age = 18
//  if(age >=18){
//     console.log("вы несовершенолетний");
//  }else{
//     console.log("вы несовершенолетний")
//  } 
 

// let Number  ("Видите число")
// if

let age =prompt("Жашынызды жазыныз!")
if(age<=15){
    alert("Салам балакай!")
}else if(age >15 && age <=30){
    alert("Салам жигит!")
}else if(age >30 && age <=50){
    alert("Салам байке!")
}else if(age >50 && age <=70){
    alert("Салам ата!")
}else if(age >70 && age <=100){
    alert("Салам чон ата!")
}else if(age >100 ){
    alert("Ушндай жаш блобу!")
}
    